cask_args appdir: "/Applications"

# Tools
brew "mas"
brew "httpie"
brew "curl"
brew "mc"
brew "wget"
brew "vim"
brew "tree"
brew "cloc"
brew "python"
brew "git-flow-avh"
brew "ffmpeg"
brew "tig"
brew "node"
brew "youtube-dl"
brew "imagemagick"
brew "unzip"


# Terminal
brew "zsh"
brew "z"
brew "zsh-autosuggestions"


# Flutter 
# FIXME
# FIXME

# Android
cask "java"
cask "android-studio"


# iOS/Swift
brew "carthage"
brew "swiftgen"
brew "swiftlint"
cask "pusher"


# Apps
cask "alfred"
cask "postman"
cask "sketch"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "visual-studio-code"
cask "iterm2"
cask "1password"
cask "charles"
cask "ngrok"
cask "brave-browser"
cask "skitch"

