cask_args appdir: "/Applications"

# System
brew "ruby"
brew "cocoapods"
brew "python"
brew "java"
brew "node"

# Terminal
brew "zsh"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fzf"
cask "iterm2"

# Git
brew "git-lfs"
brew "gitui"
brew "git-flow-avh"
cask "sourcetree"

# iOS/Swift
brew "carthage"
brew "swiftgen"
brew "swiftlint"
cask "pusher"

# Terminal Tools
brew "mas"
brew "httpie"
brew "curl"
brew "mc"
brew "wget"
brew "bfg"
brew "vim"
brew "tree"
brew "cloc"
brew "ffmpeg"
brew "youtube-dl"
brew "imagemagick"
brew "unzip"
brew "osx-cpu-temp"
brew "jq"
cask "ngrok"

# UI Apps
cask "alfred"
cask "postman"
cask "sketch"
cask "slack"
cask "visual-studio-code"
cask "1password"
cask "brave-browser"
cask "skitch"
cask "proxyman"
cask "macdown"
cask "vlc"
cask "android-studio"

# Misc
cask "aerial"
