cask_args appdir: "/Applications"

# System
brew "gpg"

# iOS/Swift
cask "xcodes-app"
brew "swiftgen"
brew "swiftlint"
brew "xcbeautify"
cask "pusher"

# Terminal
brew "zsh"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "fzf"
cask "iterm2"

# Git
brew "gh"
brew "git-lfs"
brew "gitui"
brew "lazygit"

# Terminal Tools
brew "copilot-cli"
brew "mas"
brew "httpie"
brew "curl"
brew "wget"
brew "bfg"
brew "vim"
brew "tree"
brew "cloc"
brew "ffmpeg"
brew "unzip"
brew "jq"
brew "aria2"
cask "ngrok"
brew "node"

# Fonts
cask "font-fira-code"

# UI Apps
brew "notion"
cask "alfred"
cask "postman"
cask "apidog"
cask "slack"
cask "visual-studio-code"
cask "proxyman"
cask "firefox"
