cask_args appdir: "/Applications"

# System
brew "ruby"
brew "rbenv"
brew "python"
brew "openjdk"

# Docker
cask "docker"

# Terminal Tools
brew "youtube-dl"
brew "imagemagick"
brew "yq"

# UI Apps
cask "sketch"
cask "skitch"
cask "vlc"
cask "pycharm"
cask "android-studio"
cask "intellij-idea-ce"

# Via Mac AppStore
mas "Apple Developer", id: 640199958
