cask_args appdir: "/Applications"


# Taps
tap "lokalise/cli-2"

# System
brew "ruby"
brew "python"
brew "openjdk"

# Terminal

# Git
brew "git-flow-avh"

# iOS/Swift
brew "carthage"

# Terminal Tools
brew "midnight-commander"
brew "youtube-dl"
brew "imagemagick"
brew "osx-cpu-temp"
brew "lokalise/cli-2/lokalise2"

# UI Apps
cask "insomnia"
cask "sketch"
cask "brave-browser"
cask "skitch"
cask "vlc"
cask "android-studio"
cask "intellij-idea-ce"

# Misc
cask "aerial"

# Via Mac AppStore
mas "Apple Developer", id: 640199958
mas "xScope", id: 889428659
#mas "Keynote", id: 409183694
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "GarageBand", id: 682658836
#mas "iMovie", id: 408981434
