aria2
bfg
cloc
coreutils
curl
docker
ffmpeg
fzf
git-lfs
gitui
gnupg
grep
hashicorp/tap/vault
httpie
jq
kubernetes-cli
mas
maven
midnight-commander
node
openblas
openjdk@17
perl
phrase-cli
pinentry-mac
postgresql@13
rbenv
swiftgen
swiftlint
tree
unzip
vim
wget
xcbeautify
xcodesorg/made/xcodes
yq
z
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
